app/controllers/listings_controller.rb

 def seller
    @listings = Listing.where(user: current_user).order("created_at DESC")
---
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = 6 ORDER BY created_at DESC