app/controllers/listings_controller.rb

  def index
    @listings = Listing.all
---
SELECT "listings".* FROM "listings" ORDER BY created_at DESC

  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "name", "price", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @listing.update(listing_params)
---
UPDATE "listings" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "listings"."id" = 3  [["image_file_name", "default.jpg"], ["image_file_size", 2171], ["image_updated_at", Sun, 27 Apr 2014 19:00:29 UTC +00:00], ["updated_at", Sun, 27 Apr 2014 19:00:29 UTC +00:00]]